Add diagrams to docs and books
